export default {
  /* eslint-disable no-useless-escape */
  // ip (127.0.0.1)
  ip: /^(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]{1}[0-9]{1}|[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]{1}[0-9]{1}|[1-9]|0)\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]{1}[0-9]{1}|[0-9])$/,

  // port (0～65535)
  port: /^([0-9]|[1-9]\d{1,3}|[1-5]\d{4}|6[0-5]{2}[0-3][0-5])$/,

  // email
  email: /(^\w+((-\w+)|(\.\w+))*@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+$)|(^$)/,

  // mac地址
  macAddr: /^([A-Fa-f0-9]{2}-){5}[A-Fa-f0-9]{2}$/,

  // 数字
  number: /^\d*$/,

  // 自然数 0 1 2 3 4
  naturalNum: /^(0|[1-9]\d*)$/,

  // 正整数 1 2 3 4
  positiveNum: /^[1-9]\d*$/,

  //  1～32个字符；不能包含 ' / \ : * ? " < > | 等特殊字符
  name: /^[^'\/\\:\*\?"<>\|]*$/,

  // 1-32个字符，只能用字母、数字、汉字、小数点、下划线、连接符、括号 「设备型号」
  deviceType: /^[a-zA-Z0-9\.\-_\(\)\u4E00-\u9FA5]*$/,

  // 字母、数字、汉字、小数点、下划线、连接符 [设备编码]
  deviceCode: /^[a-zA-Z0-9\.\-_\u4E00-\u9FA5#()\s]*$/,

  // 设备登录用户名 1～32个字符，只能用字母、数字、汉字、小数点、下划线、连接符。
  deviceUserName: /^[a-zA-Z0-9\.\-_\u4E00-\u9FA5]*$/,

  // 字母、数字的组合 「设备编号1-32位」
  numLetter: /^[\da-zA-Z]*$/,

  // 字母、数字、汉字的组合 「工号1-32」「入场播报」「出场播报」「放行播报」
  numLetterAndCN: /^[\da-zA-Z\u4E00-\u9FA5]*$/,

  // 字母、汉字的组合 「职位1-128」
  numAndCN: /^[a-zA-Z\u4E00-\u9FA5]*$/,

  // 字母、数字和除:\"之外的特殊字符 「设备账号1-32位」
  deviceAccount: /^[a-zA-Z0-9~`!@#\$%^&*()_+\-=\[\];',<.>/|?]{1,32}$/,

  // 车牌号
  licenseNumber: /^[^'\/\\:\*\?"<>\|]{1,16}$/,

  // 手机号
  phoneNum: /^\d{1,11}$/,

  // 姓名 1-128个数字、字母、汉字、间隔号（·）和空格
  personName: /^[\da-zA-Z\u4E00-\u9FA5· ]{1,128}$/,

  // 证件号码
  IDNumber: /^[0-9a-zA-Z]{0,20}$/,

  // 身份证号 18位，前17位为数字，尾号为数字或大写字母X。
  identityCard: /^\d{17}[\d|X]$/,

  // 密码为8-16位字符，至少由大写字母、小写字母、数字、特殊字符任意两种组成。
  password: /^(?![A-Z]+$)(?![a-z]+$)(?!\d+$)(?![\W_]+$)\S{8,16}$/,

  // 卡号 8-18个字符，只能用数字和大写字母。
  cardNum: /^[0-9A-Z]{8,18}$/,

  // 4-8位数字 「卡密码」「胁迫密码」「超级密码」
  simplePassword: /^\d{4,8}$/,

  // UUID 32位大写英文字母、数字、连接符。
  uuid: /^[a-zA-Z\d]{8}-[a-zA-Z\d]{4}-[a-zA-Z\d]{4}-[a-zA-Z\d]{4}-[a-zA-Z\d]{12}$/,
  
  // 小数点后保留一位小数
  radixPointOne: /^(([1-9]{1}\d*)|(0{1}))(\.\d{0,1})?$/
};
